examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_022/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    inlet_0
    {
        type            patch;
        nFaces          13;
        startFace       41296;
    }
    inlet_1
    {
        type            patch;
        nFaces          13;
        startFace       41309;
    }
    inlet_2
    {
        type            patch;
        nFaces          13;
        startFace       41322;
    }
    inlet_3
    {
        type            patch;
        nFaces          13;
        startFace       41335;
    }
    inlet_4
    {
        type            patch;
        nFaces          13;
        startFace       41348;
    }
    inlet_5
    {
        type            patch;
        nFaces          13;
        startFace       41361;
    }
    inlet_6
    {
        type            patch;
        nFaces          13;
        startFace       41374;
    }
    inlet_7
    {
        type            patch;
        nFaces          13;
        startFace       41387;
    }
    outlet
    {
        type            patch;
        nFaces          104;
        startFace       41400;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       41504;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       41504;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          41600;
        startFace       41904;
    }
)

// ************************************************************************* //
